tap "dart-lang/dart"
tap "homebrew/bundle"
tap "sgrastar24/tap"
tap "watr/formulae"
brew "tree"
brew "ansible"
brew "aom"
brew "glib"
brew "apache-spark"
brew "cosign"
brew "docker", link: false
brew "webp"
brew "ghostscript"
brew "git"
brew "gradle"
brew "groff"
brew "helm"
brew "libheif"
brew "imagemagick"
brew "inetutils"
brew "ipython"
brew "jpeg-xl"
brew "node"
brew "jupyterlab"
brew "python@3.9"
brew "neofetch"
brew "node@22"
brew "pnpm"
brew "python@3.10"
brew "skopeo"
brew "terraform"
brew "vercel-cli"
brew "watch"
brew "wget"
brew "watr/formulae/mbeacon"
cask "amethyst"
cask "anaconda"
cask "bluetility"
cask "rectangle"
cask "steam"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "batisteo.vscode-django"
vscode "brapifra.phpserver"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dgileadi.java-decompiler"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.php-intellisense"
vscode "github.copilot-chat"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "heron.firefox-devtools-theme"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "naco-siren.gradle-language"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tal7aouy.theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "xshrim.txt-syntax"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
cargo "avm"
