# Brewfile — install everything with: brew bundle
# Run from your dotfiles directory, or pass --file path.

# ── Taps ──────────────────────────────────────────────────────────────────────
# tap "dart-lang/dart"
tap "homebrew/bundle"
# tap "sgrastar24/tap"
tap "watr/formulae"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"         # Nerd Fonts for terminal icons

# ── Core CLI tools ────────────────────────────────────────────────────────────
brew "git"
brew "just"
brew "yq"
brew "jq"                         # JSON processor
brew "ripgrep"                    # Fast grep (rg)
brew "fd"                         # Fast find alternative
brew "bat"                        # cat with syntax highlighting
brew "eza"                        # Modern ls replacement
brew "fzf"                        # Fuzzy finder
brew "git-lfs"
brew "glib"
brew "thefuck"
brew "grype"
brew "k9s"
brew "istioctl"
brew "calicoctl"
brew "minikube"
brew "watch"
brew "wget"
# brew "tree" # use `eza -T` instead
brew "helm"
brew "docker", link: false
brew "awscli"
brew "ansible"
brew "skopeo"
brew "terraform"
brew "zsh"                        # macos ships with an old version of zsh, install the latest
brew "neofetch"
brew "tmux"                       # Terminal multiplexer
brew "starship"                   # Cross-shell prompt
brew "zoxide"                     # Smarter cd (replaces z plugin)
brew "lazygit"                    # Terminal UI for git
brew "git-delta"                  # Syntax-highlighting diff pager
brew "tldr"                       # Practical command examples
brew "btop"                       # Resource monitor (better htop)

brew "aom"
# brew "apache-spark"
# brew "webp"
# brew "groff"
# brew "ghostscript"
# brew "gradle"
# brew "libheif"
# brew "imagemagick"
# brew "inetutils"
# brew "ipython"
# brew "jpeg-xl"
# brew "node"
# brew "jupyterlab"
# brew "kubectl"

# ── Development ───────────────────────────────────────────────────────────────
brew "cosign"
brew "python@3.9"
brew "node@22"
brew "pnpm"
brew "python@3.10"
brew "vercel-cli"
brew "watr/formulae/mbeacon"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "nvm"

# ── Apps (Casks) ──────────────────────────────────────────────────────────────
cask "anaconda"
cask "miniconda"
cask "bluetility"
cask "rectangle"
cask "visual-studio-code"
cask "iterm2"
cask "basictex"
cask "obs"
cask "spotify"
cask "vial"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"   # Great for terminal + VS Code

# cask "steam"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "batisteo.vscode-django"
vscode "dbaeumer.vscode-eslint"
vscode "dgileadi.java-decompiler"
# vscode "donjayamanne.python-environment-manager"
# vscode "donjayamanne.python-extension-pack"
# vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "mhutchie.git-graph"
vscode "github.copilot-chat"
# vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "heron.firefox-devtools-theme"
# vscode "k--kato.intellij-idea-keybindings"
# vscode "kevinrose.vsc-python-indent"
# vscode "magicstack.magicpython"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vscode.vscode-typescript-next"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tal7aouy.theme"
vscode "vscode-icons-team.vscode-icons"
# vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
# vscode "wholroyd.jinja"
# vscode "xabikos.javascriptsnippets"
# vscode "xabikos.reactsnippets"
vscode "xshrim.txt-syntax"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "skellock.just"
cargo "avm"
