4ops.terraform
aaron-bond.better-comments
batisteo.vscode-django
brapifra.phpserver
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
dgileadi.java-decompiler
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dotjoshjohnson.xml
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
felixfbecker.php-intellisense
github.copilot-chat
grapecity.gc-excelviewer
graphql.vscode-graphql
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
heron.firefox-devtools-theme
k--kato.intellij-idea-keybindings
kevinrose.vsc-python-indent
magicstack.magicpython
mathiasfrohlich.kotlin
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.hexeditor
ms-vscode.remote-explorer
ms-vscode.vscode-typescript-next
naco-siren.gradle-language
njpwerner.autodocstring
octref.vetur
redhat.fabric8-analytics
redhat.java
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
tal7aouy.theme
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vue.volar
waderyan.gitblame
wayou.vscode-todo-highlight
wholroyd.jinja
xabikos.javascriptsnippets
xabikos.reactsnippets
xshrim.txt-syntax
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
