4ops.terraform
aaron-bond.better-comments
batisteo.vscode-django
dbaeumer.vscode-eslint
dgileadi.java-decompiler
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
mhutchie.git-graph
github.copilot-chat
graphql.vscode-graphql
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
heron.firefox-devtools-theme
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
njpwerner.autodocstring
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
tal7aouy.theme
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
xshrim.txt-syntax
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
skellock.just
